Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Matchbox consists of a number of interchangeable and optional applications that you can tailor to a specific, non-desktop platform to enhance usability in constrained environments.
it_it: Matchbox è composto da una serie di applicazioni intercambiabili e opzionali che è possibile adattare a una specifica piattaforma non desktop per migliorarne l'usabilità in ambienti con risorse limitate.

source: Maybe you have an application or specific set of behaviors you need to isolate. You can create your own general layer using the ``bitbake-layers create-layer`` command. The tool automates layer creation by setting up a subdirectory with a ``layer.conf`` configuration file, a ``recipes-example`` subdirectory that contains an ``example.bb`` recipe, a licensing file, and a ``README``.
it_it: Magari si ha un'applicazione o un insieme specifico di comportamenti da isolare. Si può creare un layer generico personalizzato utilizzando il comando ``bitbake-layers create-layer``. Il tool automatizza la creazione dei layer impostando una sottocartella con un file di configurazione ``layer.conf``, una sottocartella ``recipes-example`` contenente una ricetta ``example.bb``, un file di licenza e un file ``README``.

source: Metadata about the CVE issue such as description and NVD link
it_it: Metadati relativi al problema CVE, come descrizione e collegamento NVD

source: Metadata about the software component like names and versions
it_it: Metadati relativi al componente software, come nomi e versioni

source: Metadata improvements and refactoring, unless this is a dependency of a required fix
it_it: Miglioramenti e refactoring dei metadati, a meno che non siano una dipendenza di una correzione necessaria

source: Metadata, Machine Configuration, and Policy Configuration
it_it: Metadati, Configurazione della Macchina e Configurazione delle Policy

source: Michael Halstead: <mhalstead [at] linuxfoundation [dot] org> `Public key <https://pgp.mit.edu/pks/lookup?op=vindex&search=0x3373170601861969>`__ or `Public key <https://keyserver.ubuntu.com/pks/lookup?op=get&search=0xd1f2407285e571ed12a407a73373170601861969>`__
it_it: Michael Halstead: <mhalstead [at] linuxfoundation [dot] org> `Chiave pubblica <https://pgp.mit.edu/pks/lookup?op=vindex&search=0x3373170601861969>`__ o `Chiave pubblica <https://keyserver.ubuntu.com/pks/lookup?op=get&search=0xd1f2407285e571ed12a407a73373170601861969>`__

source: Minimum Free Disk Space
it_it: Spazio Libero Minimo su Disco

source: Minimum System RAM
it_it: RAM Minima di Sistema

source: Miscellaneous BSP-Specific Recipe Files
it_it: File di Ricette Specifici per BSP

source: Modify the patch adding OE-related metadata. We will follow the example of the ``CVE-2022-3341.patch``.
it_it: Modificare la patch aggiungendo i metadati relativi a OE. Seguiremo l'esempio della patch ``CVE-2022-3341.patch``.

source: Most of the common post-installation scripts generated by the build system for the out-of-the-box Yocto Project are engineered so that they can run during root filesystem creation (e.g. post-installation scripts for caching fonts). However, if you create and add custom scripts, you need to be sure they can be run during this file system creation.
it_it: La maggior parte degli script di post-installazione comuni generati dal sistema di build per Yocto Project di default sono progettati per essere eseguiti durante la creazione del filesystem root (ad esempio, gli script di post-installazione per la cache dei font). Tuttavia, se si creano e si aggiungono script personalizzati, è necessario assicurarsi che possano essere eseguiti durante la creazione del filesystem.

source: Most of the tools are available only in ``sdk`` images or in images built after adding ``tools-profile`` to the :term:`EXTRA_IMAGE_FEATURES` variable.
it_it: La maggior parte degli strumenti è disponibile solo nelle immagini ``sdk`` o nelle immagini create dopo aver aggiunto ``tools-profile`` alla variabile :term:`EXTRA_IMAGE_FEATURES`.

source: Most of the work occurs on the Build Host. This is the machine used to build images and generally work within the Yocto Project environment. When you run :term:`BitBake` to create an image, the OpenEmbedded build system uses the host ``gcc`` compiler to bootstrap a cross-compiler named ``gcc-cross`` (or ``clang-cross`` if Clang is used). This compiler is what BitBake uses to compile source files when creating the target image. You can think of it simply as an automatically generated cross-compiler that is used internally within BitBake only.
it_it: La maggior parte del lavoro viene svolta sull'host di build. Si tratta della macchina utilizzata per creare le immagini e, in generale, per lavorare all'interno dell'ambiente di Yocto Project. Quando si esegue :term:`BitBake` per creare un'immagine, il sistema di build OpenEmbedded utilizza il compilatore ``gcc`` dell'host per avviare un cross-compilatore chiamato ``gcc-cross`` (o ``clang-cross`` se si utilizza Clang). Questo compilatore è quello che BitBake usa per compilare i file sorgente durante la creazione dell'immagine target. Si può pensare a questo compilatore come a un cross-compilatore generato automaticamente e utilizzato internamente solo da BitBake.

source: Multilib feature testing
it_it: Test delle funzionalità di Multilib

source: Namely, it contains the distro :term:`configuration file` for Poky: ``conf/distro/poky.conf``.
it_it: Nello specifico, contiene il :term:`configuration file` della distribuzione per Poky: ``conf/distro/poky.conf``.

source: Native tool updates. Though the depending tasks should be rebuilt, it's likely that they will generate the same output and be marked as equivalent.
it_it: Aggiornamenti di strumenti nativi. Sebbene i task dipendenti debbano essere ricompilati, è probabile che generino lo stesso output e vengano contrassegnati come equivalenti.

source: Navigate to the root of your :term:`Source Directory` (e.g. ``poky``)::
it_it: Accedere alla :term:`Source Directory` del progetto (ad esempio, ``poky``)::

source: New features
it_it: Nuove funzionalità

source: Next, from the :term:`Build Directory` (e.g. ``poky/build``), start Toaster using this command::
it_it: Successivamente, dalla :term:`Build Directory` (ad esempio, ``poky/build``), avviare Toaster con questo comando::

source: No determination has been made yet, or patch has not yet been submitted to upstream.
it_it: Non è stata ancora presa alcuna decisione oppure la patch non è stata ancora inviata al progetto upstream.

source: No maintainers
it_it: Nessun manutentore

source: Normally, to execute this probe, you'd just install SystemTap on the system you want to probe, and directly run the probe on that system e.g. assuming the name of the file containing the above text is ``trace_open.stp``::
it_it: Normalmente, per eseguire questa sonda [probe], è sufficiente installare SystemTap sul sistema che si desidera analizzare ed eseguire direttamente la sonda su tale sistema, ad esempio, supponendo che il nome del file contenente il testo sopra riportato sia ``trace_open.stp``::

source: Normally, you should be able to open the manual pages via perf itself e.g. ``perf help`` or ``perf help record``.
it_it: Normalmente, si dovrebbe essere in grado di aprire le pagine del manuale tramite perf stesso, ad esempio ``perf help`` o ``perf help record``.

source: Not accepted by upstream, include reason in patch.
it_it: Non accettata dal progetto upstream; includere la motivazione nella patch.

source: Note also that we have both kernel and user space entries in the above snapshot. We can also tell perf to focus on user space but providing a modifier, in this case ``u``, to the ``cycles`` hardware counter when we record a profile::
it_it: Notare inoltre che nell'immagine qui sopra sono presenti voci sia per lo spazio kernel che per lo spazio utente. Possiamo anche indicare a perf di concentrarsi sullo spazio utente, fornendo un modificatore, in questo caso ``u``, al contatore hardware ``cycles`` durante la registrazione di un profilo::

source: Note that because tracepoints are normally used for tracing, the default sampling period for tracepoints is ``1`` i.e. for tracepoints perf will sample on every event occurrence (this can be changed using the ``-c`` option). This is in contrast to hardware counters such as for example the default ``cycles`` hardware counter used for normal profiling, where sampling periods are much higher (in the thousands) because profiling should have as low an overhead as possible and sampling on every cycle would be prohibitively expensive.
it_it: Si noti che, poiché i tracepoint vengono normalmente utilizzati per il tracing, il periodo di campionamento predefinito per i tracepoint è ``1``, ovvero perf effettuerà un campionamento a ogni occorrenza dell'evento (questo valore può essere modificato utilizzando l'opzione ``-c``). Ciò è in contrasto con i contatori hardware, come ad esempio il contatore hardware predefinito ``cycles`` utilizzato per la normale profilazione, dove i periodi di campionamento sono molto più elevati (nell'ordine delle migliaia) perché la profilazione dovrebbe avere un overhead il più basso possibile e il campionamento a ogni ciclo sarebbe eccessivamente oneroso.

source: Note that if the CVE entries in the NVD database contain bugs or have missing or incomplete information, it is recommended to fix the information there directly instead of working around the issues possibly for a long time in :term:`OpenEmbedded-Core (OE-Core)` side recipes. Feedback to NVD about CVE entries can be provided through the `NVD contact form <https://nvd.nist.gov/info/contact-form>`__.
it_it: Si noti che se le voci CVE nel database NVD contengono bug o informazioni mancanti o incomplete, si consiglia di correggere direttamente le informazioni nel database stesso, anziché cercare di aggirare i problemi, eventualmente per lungo tempo, nelle ricette di :term:`OpenEmbedded-Core (OE-Core)`. È possibile fornire feedback a NVD in merito alle voci CVE tramite il `modulo di contatto NVD <https://nvd.nist.gov/info/contact-form>`__.

source: Note that if there are many CVEs with the same status and reason, those can be shared by using the :term:`CVE_STATUS_GROUPS` variable.
it_it: Si noti che se sono presenti più CVE con lo stesso stato e motivo, questi possono essere condivisi utilizzando la variabile :term:`CVE_STATUS_GROUPS`.

source: Note that the Yocto Project doesn't have access to private updates that some of these versions may have. Therefore, our testing has limited value if you have access to such updates. Also, :term:`buildtools` may have to be used on older releases in order to get current enough tools, such as Python.
it_it: Si noti che Yocto Project non ha accesso agli aggiornamenti privati ​​che alcune di queste versioni potrebbero avere. Pertanto, i nostri test hanno un valore limitato se si ha accesso a tali aggiornamenti. Inoltre, potrebbe essere necessario utilizzare :term:`buildtools` sulle versioni precedenti per ottenere strumenti sufficientemente aggiornati, come Python.

source: Note that the trace is saved in a directory of the same name as returned by ``lttng create``, under the ``~/lttng-traces`` directory (note that you can change this by supplying your own name to ``lttng create``)::
it_it: Notare che la traccia viene salvata in una directory con lo stesso nome restituito da ``lttng create``, nella directory ``~/lttng-traces`` (notare che lòa si può modificare specificando un nome personalizzato a ``lttng create``)::

source: Note that these are exactly the same sets of events described in the previous trace events subsystem section, and in fact is where trace-cmd gets them for KernelShark.
it_it: Notare che si tratta esattamente degli stessi set di eventi descritti nella precedente sezione relativa ai sottosistemi di tracciamento, ed è proprio da qui che trace-cmd li preleva per KernelShark.

source: Note that this is pretty much exactly the same information we get from ``perf stat``, which goes a little way to support the idea mentioned previously that given the right kind of trace data, higher-level profiling-type summaries can be derived from it.
it_it: Si noti che si tratta praticamente delle stesse informazioni che otteniamo da ``perf stat``, il che supporta in parte l'idea menzionata in precedenza, ovvero che, con i dati di traccia appropriati, è possibile ricavare da essi riepiloghi di profilazione di livello superiore.

source: Note that this list just gives suggestions and is not exhaustive. More details can be found here: :ref:`test-manual/intro:Yocto Project Tests --- Types of Testing Overview`.
it_it: Si noti che questo elenco fornisce solo suggerimenti e non è esaustivo. Maggiori dettagli sono disponibili qui: :ref:`test-manual/intro:Yocto Project Tests --- Types of Testing Overview`.

source: Notice also that here there's also a case where the hex value is displayed in the call stack, here in the expanded ``sys_clock_gettime()`` function. Later we'll see it resolve to a user space function call in BusyBox.
it_it: Si noti inoltre che anche in questo caso il valore esadecimale viene visualizzato nello stack di chiamate, qui nella funzione ``sys_clock_gettime()`` espansa. Più avanti vedremo che si risolve in una chiamata di funzione in spazio utente in BusyBox.

source: Notice also that the above report shows an entry for ``busybox``, which is the executable that implements ``wget`` in Yocto, but that instead of a useful function name in that entry, it displays a not-so-friendly hex value instead. The steps below will show how to fix that problem.
it_it: Si noti inoltre che il report sopra riportato mostra una voce per ``busybox``, ovvero l'eseguibile che implementa ``wget`` in Yocto, ma che invece di un nome di funzione utile, in quella voce viene visualizzato un valore esadecimale poco leggibile. I passaggi seguenti mostreranno come risolvere questo problema.

source: Notice in the screenshot above, we see only user space entries (``[.]``)
it_it: Nella schermata precedente, notiamo che vengono visualizzate solo le voci relative allo spazio utente (``[.]``)

source: Notice that each entry in the above screenshot now contains a ``+`` on the left side. This means that we can expand the entry and drill down into the call chains that feed into that entry. Pressing ``Enter`` on any one of them will expand the call chain (you can also press ``E`` to expand them all at the same time or ``C`` to collapse them all).
it_it: Notate che ogni voce nella schermata precedente ora contiene un ``+`` sul lato sinistro. Questo significa che possiamo espandere la voce e analizzare in dettaglio le catene di chiamate che alimentano quella voce. Premendo ``Enter`` su una qualsiasi di esse, si espanderà la catena di chiamate (è anche possibile premere ``E`` per espanderle tutte contemporaneamente o ``C`` per comprimerle tutte).

source: Notice that the right pane shows the exact trace-cmd command-line that's used to run the trace, along with the results of the trace-cmd run.
it_it: Notare che il riquadro di destra mostra l'esatta riga di comando trace-cmd utilizzata per eseguire la traccia, insieme ai risultati dell'esecuzione di trace-cmd.

source: Notice that there are many events that don't really have anything to do with what we're interested in, namely events that schedule ``perf`` itself in and out or that wake perf up. We can get rid of those by using the ``--filter`` option --- for each event we specify using ``-e``, we can add a ``--filter`` after that to filter out trace events that contain fields with specific values::
it_it: Notare che ci sono molti eventi che non hanno nulla a che fare con ciò che ci interessa, ovvero gli eventi che pianificano l'avvio e la disattivazione di ``perf`` o che lo riattivano. Possiamo eliminarli utilizzando l'opzione ``--filter``: per ogni evento specificato con ``-e``, possiamo aggiungere ``--filter`` per filtrare gli eventi di traccia che contengono campi con valori specifici::

source: Now install the debug RPM on the target::
it_it: Ora installiamo il pacchetto RPM di debug sul sistema target::

source: Now that the debugging information is installed, we see that the BusyBox entries now display their functions symbolically:
it_it: Ora che le informazioni di debug sono installate, vediamo che le voci di BusyBox visualizzano le loro funzioni in forma simbolica:

source: Now that we have the trace data in ``perf.data``, we can use ``perf script -g`` to generate a skeleton script with handlers for the read / write entry / exit events we recorded::
it_it: Ora che abbiamo i dati di traccia in ``perf.data``, possiamo usare ``perf script -g`` per generare uno script di base con gestori per gli eventi di lettura/scrittura in entrata/uscita che abbiamo registrato::

source: Now that we've seen the basic layout of the profile data and the basics of how to extract useful information out of it, let's get back to the task at hand and see if we can get some basic idea about where the time is spent in the program we're profiling, wget. Remember that wget is actually implemented as an applet in BusyBox, so while the process name is ``wget``, the executable we're actually interested in is ``busybox``. Therefore, let's expand the first entry containing BusyBox:
it_it: Ora che abbiamo visto la struttura di base dei dati del profilo e le nozioni fondamentali su come estrarne informazioni utili, torniamo al compito principale e cerchiamo di capire dove viene impiegato il tempo nel programma che stiamo profilando, wget. Ricordiamo che wget è implementato come applet in BusyBox, quindi, sebbene il nome del processo sia ``wget``, l'eseguibile che ci interessa è ``busybox``. Pertanto, espandiamo la prima voce contenente BusyBox:

source: Now that you have experienced using the Yocto Project, you might be asking yourself "What now?". The Yocto Project has many sources of information including the website, wiki pages, and user manuals:
it_it: Ora che c'è familiarità con lo Yocto Project, ci si potrebbe chiedere "E adesso?". Lo Yocto Project offre numerose fonti di informazione, tra cui il sito web, le pagine wiki e i manuali utente:

source: Now that you have set up the build to sign shared state artifacts, let's see how you can verify them with the public key counterpart of the private key.
it_it: Ora che è stato configurata la build per firmare gli artefatti dello shared state, vediamo come so possono verificare con la corrispondente chiave pubblica della chiave privata.

source: Now, if we look at the ``trace`` file, we see nothing but the ``kmalloc`` events we just turned on::
it_it: Ora, se esaminiamo il file ``trace``, non vediamo altro che gli eventi ``kmalloc`` che abbiamo appena attivato::

source: Now, imagine that a Shared State task is modified because of a change in its code or metadata, or because of a change in its dependencies. Since this modifies its task hash, this task will need re-executing. Its output hash will therefore be computed again.
it_it: Ora, immaginiamo che un task di Shared State venga modificata a causa di una modifica al suo codice o ai suoi metadati, oppure a causa di una modifica alle sue dipendenze. Poiché ciò modifica il suo hash, il task dovrà essere rieseguito. Il suo hash di output verrà quindi ricalcolato.

source: Now, try executing the task:
it_it: Ora, provare a eseguire il task:

source: Nowadays, the :term:`Poky` **repository** is no longer updated as :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>` became the preferred way of setting up the repositories in order to build the :term:`Poky` distro.
it_it: Oggigiorno, il **repository** :term:`Poky` non viene più aggiornato, poiché :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>` è diventato il metodo preferito per configurare i repository e compilare la distribuzione :term:`Poky`.

source: OE-Core is metadata comprised of foundational recipes, classes, and associated files that are meant to be common among many different OpenEmbedded-derived systems, including the Yocto Project. OE-Core is a curated subset of an original repository developed by the OpenEmbedded community that has been pared down into a smaller, core set of continuously validated recipes. The result is a tightly controlled and an quality-assured core set of recipes.
it_it: OE-Core è un insieme di metadati composto da ricette, classi e file associati fondamentali, pensati per essere comuni a molti sistemi derivati ​​da OpenEmbedded, incluso Yocto Project. OE-Core è un sottoinsieme curato di un repository originale sviluppato dalla comunità OpenEmbedded, ridotto a un insieme più piccolo e centrale di ricette continuamente validate. Il risultato è un insieme di ricette di base rigorosamente controllato e di qualità garantita.

source: Occasionally, a layer might provide more than one version of the same recipe. For example, the ``openembedded-core`` layer provides two versions of the ``bash`` recipe (i.e. 3.2.48 and 4.3.30-r0) and two versions of the ``which`` recipe (i.e. 2.21 and 2.18). The following figure shows this exact scenario:
it_it: Occasionalmente, un layer potrebbe fornire più di una versione della stessa ricetta. Ad esempio, il layer ``openembedded-core`` fornisce due versioni della ricetta ``bash`` (ovvero 3.2.48 e 4.3.30-r0) e due versioni della ricetta ``which`` (ovvero 2.21 e 2.18). La figura seguente mostra esattamente questo scenario:

source: Of course, if another person later takes care of submitting this patch upstream, the status should be changed to ``Submitted [where]``, and an additional ``Signed-off-by:`` line should be added to the patch by the person claiming responsibility for upstreaming.
it_it: Naturalmente, se in seguito un'altra persona si occupa di inviare questa patch al progetto upstream, lo stato dovrebbe essere modificato in ``Submitted [where]`` e la persona che si assume la responsabilità dell'invio dovrebbe aggiungere alla patch una riga aggiuntiva con la dicitura ``Signed-off-by:``.

source: On Debian 11 and Ubuntu 22.04, the minimum version for ``python3-websockets`` is not satisfied by the host distribution. This package is used for fetching pre-built :ref:`shared state <overview-manual/concepts:shared state>` artifacts from upstream Yocto Project servers (see :ref:`ref-fragments-core-yocto-sstate-mirror-cdn` for more information).
it_it: Su Debian 11 e Ubuntu 22.04, la versione minima di ``python3-websockets`` non è soddisfatta dalla distribuzione host. Questo pacchetto viene utilizzato per scaricare gli artefatti :ref:`shared state <overview-manual/concepts:shared state>` precompilati dai server di Yocto Project (vedere :ref:`ref-fragments-core-yocto-sstate-mirror-cdn` per maggiori informazioni).

source: On the host system, you should also see a trace summary for the trace just ended::
it_it: Sul sistema host, si dovrebbe anche vedere un riepilogo della traccia appena terminata::

source: On the host system, you should see this::
it_it: Sul sistema host, si dovrebbe vedere quanto segue::

source: On the machine that is able to run BitBake, be sure you have set up your build environment with the setup script (:ref:`structure-core-script`).
it_it: Sulla macchina in grado di eseguire BitBake, assicurarsi di aver configurato l'ambiente di build con lo script di configurazione (:ref:`structure-core-script`).

source: On the target system that is going to be traced, start blktrace in client mode with the -h option to connect to the host system, also passing it the device to trace::
it_it: Sul sistema target che verrà tracciato, si avvia blktrace in modalità client con l'opzione -h per connettersi al sistema host, passando anche il dispositivo da tracciare::
